### Shark attaks

In [ ]:
# SABINA COMMENT: WOuld remove all pip install boxes once you are done with them
# since they only need to be done once and not everytime you open the notebook!
!pip install pandas openpyxl

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: openpyxl in /opt/anaconda3/lib/python3.13/site-packages (3.1.5)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: et_xmlfile in /opt/anaconda3/lib/python3.13/site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [352]:
!pip install xlrd

Requirement already satisfied: xlrd in /opt/anaconda3/lib/python3.13/site-packages (2.0.2)

In [353]:
import pandas as pd

In [354]:
!pip install numpy

Requirement already satisfied: numpy in /opt/anaconda3/lib/python3.13/site-packages (2.1.3)

In [355]:
import numpy as np

In [356]:
df = pd.read_excel ("GSAF5.xls")
df.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,...,Nurse shark,Kevin McMurray Trackingsharks.com Andy Currie,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,...,Tiger or Bull shark,Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,...,Bronze whaler?,Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,...,unknown 1.2m shark,Todd Smith: Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,...,Tiger shark 4m,Todd Smith: Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [357]:
df.tail()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
7045,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,...,NaN,"H. Taunton; N. Bartlett, p. 234",ND-0005-RoebuckBay.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0005,ND.0005,6.0,NaN,NaN
7046,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,...,NaN,"H. Taunton; N. Bartlett, pp. 233-234",ND-0004-Ahmun.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0004,ND.0004,5.0,NaN,NaN
7047,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,...,NaN,"F. Schwartz, p.23; C. Creswell, GSAF",ND-0003-Ocracoke_1900-1905.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0003,ND.0003,4.0,NaN,NaN
7048,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,...,NaN,"The Sun, 10/20/1938",ND-0002-JulesPatterson.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0002,ND.0002,3.0,NaN,NaN
7049,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,...,NaN,S.W. Baker,ND-0001-Ceylon.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0001,ND.0001,2.0,NaN,NaN

In [358]:
df.shape

(7050, 23)

In [359]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7050 entries, 0 to 7049
Data columns (total 23 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            7050 non-null   object
 1   Year            7048 non-null   float64
 2   Type            7032 non-null   object
 3   Country         7000 non-null   object
 4   State           6564 non-null   object
 5   Location        6483 non-null   object
 6   Activity        6465 non-null   object
 7   Name            6831 non-null   object
 8   Sex             6471 non-null   object
 9   Age             4056 non-null   object
 10  Injury          7015 non-null   object
 11  Fatal Y/N       6489 non-null   object
 12  Time            3524 non-null   object
 13  Species         3919 non-null   object
 14  Source          7030 non-null   object
 15  pdf             6799 non-null   object
 16  href formula    6794 non-null   object
 17  href            6796 non-null   object
 18  Case Number     6798 non-null   object
 19  Case Number.1   6797 non-null   object
 20  original order  6799 non-null   float64
 21  Unnamed: 21     1 non-null      object
 22  Unnamed: 22     2 non-null      object
dtypes: float64(2), object(21)
memory usage: 1.2+ MB

In [360]:
df.columns.tolist() # I see extra columns that were probably hidden in the excel file

['Date',
 'Year',
 'Type',
 'Country',
 'State',
 'Location',
 'Activity',
 'Name',
 'Sex',
 'Age',
 'Injury',
 'Fatal Y/N',
 'Time',
 'Species ',
 'Source',
 'pdf',
 'href formula',
 'href',
 'Case Number',
 'Case Number.1',
 'original order',
 'Unnamed: 21',
 'Unnamed: 22']

In [361]:
df = df.iloc[:, :-9] # removing last 9 columns
df

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Time,Species
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Not stated,Nurse shark
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,Serious abdonminal injuries,N,1823 hrs,Tiger or Bull shark
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,1330hrs,Bronze whaler?
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,Leg and foot injury,N,0100hrs,unknown 1.2m shark
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,Head face and arms,N,Not stated,Tiger shark 4m
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7045,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,FATAL,Y,NaN,NaN
7046,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,FATAL,Y,NaN,NaN
7047,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,FATAL,Y,NaN,NaN
7048,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,FATAL,Y,NaN,NaN
7049,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN

In [362]:
df.columns.tolist() # Now I have 14 columns that I need

['Date',
 'Year',
 'Type',
 'Country',
 'State',
 'Location',
 'Activity',
 'Name',
 'Sex',
 'Age',
 'Injury',
 'Fatal Y/N',
 'Time',
 'Species ']

In [363]:
df.nunique()

Date         6094
Year          261
Type           13
Country       249
State         939
Location     4598
Activity     1608
Name         5774
Sex            10
Age           251
Injury       4167
Fatal Y/N      12
Time          462
Species      1729
dtype: int64

In [ ]:
# SABINA COMMENT: This is a method, not an attribute!
# Corrected: df.select_dtypes('number') to get only numerical columns
df.select_dtypes

<bound method DataFrame.select_dtypes of                 Date    Year        Type             Country  \
0       14th October  2025.0  Unprovoked            Columbia
1       11th October  2025.0  Unprovoked           Australia
2        7th October  2025.0  Unprovoked           Australia
3     29th September  2025.0  Unprovoked                 USA
4     27th September  2025.0    Provoked          Costa Rica
...              ...     ...         ...                 ...
7045     Before 1903     0.0  Unprovoked           AUSTRALIA
7046     Before 1903     0.0  Unprovoked           AUSTRALIA
7047       1900-1905     0.0  Unprovoked                 USA
7048       1883-1889     0.0  Unprovoked              PANAMA
7049       1845-1853     0.0  Unprovoked  CEYLON (SRI LANKA)

                      State                             Location  \
0      Bolivar, del Isolate                    Catagena Province
1                Queensland       Cook Esplanade Thursday Island
2           South Australia                      Kangaroo Island
3            Off California                      Catalina Island
4                       NaN                        Cocos Islands
...                     ...                                  ...
7045      Western Australia                          Roebuck Bay
7046      Western Australia                                  NaN
7047         North Carolina                       Ocracoke Inlet
7048                    NaN                 Panama Bay 8ºN, 79ºW
7049       Eastern Province  Below the English fort, Trincomalee

                   Activity                   Name Sex  Age  \
0      Swimming with sharks             Male child   M   14
1          Fishing/swimming             Samuel Nai   M   14
2                   Surfing           Lee Berryman   M  50+
3                  Swimming     Christopher Murray   M   54
4     Diving-Tagging sharks     Dr. Mauricio Hoyos   M   48
...                     ...                    ...  ..  ...
7045                 Diving                   male   M  NaN
7046           Pearl diving                  Ahmun   M  NaN
7047               Swimming  Coast Guard personnel   M  NaN
7048                    NaN        Jules Patterson   M  NaN
7049               Swimming                   male   M   15

                                                 Injury Fatal Y/N        Time  \
0                                    Severe hand injury         N  Not stated
1                           Serious abdonminal injuries         N    1823 hrs
2                                  Lacerations to calf          N     1330hrs
3                                   Leg and foot injury         N     0100hrs
4                                    Head face and arms         N  Not stated
...                                                 ...       ...         ...
7045                                              FATAL         Y         NaN
7046                                              FATAL         Y         NaN
7047                                              FATAL         Y         NaN
7048                                              FATAL         Y         NaN
7049  FATAL. "Shark bit him in half, carrying away t...         Y         NaN

                 Species
0            Nurse shark
1     Tiger or Bull shark
2          Bronze whaler?
3      unknown 1.2m shark
4          Tiger shark 4m
...                   ...
7045                  NaN
7046                  NaN
7047                  NaN
7048                  NaN
7049                  NaN

[7050 rows x 14 columns]>

In [365]:
df.dtypes

Date          object
Year         float64
Type          object
Country       object
State         object
Location      object
Activity      object
Name          object
Sex           object
Age           object
Injury        object
Fatal Y/N     object
Time          object
Species       object
dtype: object

# Clean `Date` and `Year` columns

SABINA COMMENT: Would add sections like this one!

In [ ]:
df[["Year"]].tail() # year has missing values # SABINA COMMENT: Where? :eye-emoji:

      Year
7045   0.0
7046   0.0
7047   0.0
7048   0.0
7049   0.0

In [367]:
df[["Date"]].sample(20) # date includes the year

                       Date
3544            20-Apr-1986
5707            14-Feb-1933
6393    Reportd 15-Jul-1894
1476            31-Jul-2012
4438            22-Jan-1964
4657               Feb-1961
6899              June 1721
2330            22-Feb-2005
3512            19-Feb-1987
2496            03-May-2003
6078   Reported 14-Mar-1914
4818            02-Jul-1959
6094           12-July-1913
4154            22-Aug-1969
2107            20-Apr-2007
3222            22-Mar-1993
6395            25-Jun-1894
2606            04-Jan-2002
1117            01-Jul-2015
705   Reported 09-Jul-2018.

In [368]:
df["Temp_year"] = df["Date"].astype(str).str.extract(r'(\d{4})').astype(float) # adding new temporary column to extract 4 digits of year from the column Date
df["Temp_year"]

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
         ...
7045    1903.0
7046    1903.0
7047    1900.0
7048    1883.0
7049    1845.0
Name: Temp_year, Length: 7050, dtype: float64

In [ ]:
df[['Date', 'Year', 'Temp_year']].sample(20)
# SABINA COMMENT: What do you see?

                      Date    Year  Temp_year
782            23-Oct-2017  2017.0     2017.0
2198           27-May-2006  2006.0     2006.0
3896           06-Oct-1976  1976.0     1976.0
560            24-Sep-2019  2019.0     2019.0
3086           28-Jul-1995  1995.0     1995.0
5179           22-May-1951  1951.0     1951.0
312            09-Jan-2022  2022.0     2022.0
6513  Reported 08-Dec-1884  1884.0     1884.0
3026           07-May-1996  1996.0     1996.0
5226                 1950s  1950.0     1950.0
3002           06-Sep-1996  1996.0     1996.0
177            24 May 2023  2023.0     2023.0
2892           13-Aug-1998  1998.0     1998.0
6560           02-May-1880  1880.0     1880.0
3165           23-Mar-1994  1994.0     1994.0
4046           08-Dec-1972  1972.0     1972.0
6515           18-Aug-1884  1884.0     1884.0
2291           13-Jul-2005  2005.0     2005.0
1111           08-Jul-2015  2015.0     2015.0
4622              Jul-1961  1961.0     1961.0

In [370]:
df['Year'] = df['Year'].fillna(df['Temp_year']) # Fill in the NaN in the Year column with the Temp year
df[['Date', 'Year', 'Temp_year']].sample(20)

             Date    Year  Temp_year
2089  24-Jun-2007  2007.0     2007.0
5014  03-Sep-1955  1955.0     1955.0
622   25-Mar-2019  2019.0     2019.0
6003  10-Aug-1919  1919.0     1919.0
156   24 Jul-2023  2023.0     2023.0
2651  24-Jul-2001  2001.0     2001.0
524   05-Jan-2020  2020.0     2020.0
5890  26-Jan-1926  1926.0     1926.0
6287  Summer 1901  1901.0     1901.0
3685  23-Oct-1962  1982.0     1962.0
2909  16-May-1998  1998.0     1998.0
917   14-Nov-2016  2016.0     2016.0
3645  20-Aug-1983  1983.0     1983.0
2665  20-May-2001  2001.0     2001.0
4740  28-Mar-1960  1960.0     1960.0
706   07-Jul-2018  2018.0     2018.0
1539  27-Jan-2012  2012.0     2012.0
668   29-Sep-2018  2018.0     2018.0
260   07-Jul-2022  2022.0     2022.0
4158  27-Jul-1969  1969.0     1969.0

In [ ]:
# SABINA COMMENT: I think the OR condition would be easier to read here:
# (df['Year'] >= 1976) | (df['Temp_year'] >= 1976)
df_50 = df[~((df['Year'] < 1976) & (df['Temp_year'] < 1976))]
df_50[["Year", "Temp_year"]]

        Year  Temp_year
0     2025.0        NaN
1     2025.0        NaN
2     2025.0        NaN
3     2025.0        NaN
4     2025.0        NaN
...      ...        ...
7020     0.0        NaN
7023     0.0        NaN
7027     0.0        NaN
7028     0.0        NaN
7029     0.0        NaN

[3973 rows x 2 columns]

In [ ]:
df_50['Match_check'] = df_50['Year'] == df_50['Temp_year']
df_50['Match_check']
# SABINA COMMENT: Nice!

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/2696524239.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50['Match_check'] = df_50['Year'] == df_50['Temp_year']

0       False
1       False
2       False
3       False
4       False
        ...
7020    False
7023    False
7027    False
7028    False
7029    False
Name: Match_check, Length: 3973, dtype: bool

In [373]:
print(df_50['Match_check'].value_counts())

Match_check
True     3881
False      92
Name: count, dtype: int64

In [ ]:
# SABINA COMMENT: You can also use df_50[~df_50['Match_check']]
df_50_false = df_50[df_50['Match_check'] == False]
df_50_false [["Year", "Temp_year"]]

        Year  Temp_year
0     2025.0        NaN
1     2025.0        NaN
2     2025.0        NaN
3     2025.0        NaN
4     2025.0        NaN
...      ...        ...
7020     0.0        NaN
7023     0.0        NaN
7027     0.0        NaN
7028     0.0        NaN
7029     0.0        NaN

[92 rows x 2 columns]

In [375]:
df_50['Year'] = pd.to_numeric(df_50['Year'], errors='raise')   # turning the columns into numeric value to compare
df_50['Temp_year'] = pd.to_numeric(df_50['Temp_year'], errors='raise')

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/3594179196.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50['Year'] = pd.to_numeric(df_50['Year'], errors='raise')   # turning the columns into numeric value to compare
/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/3594179196.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50['Temp_year'] = pd.to_numeric(df_50['Temp_year'], errors='raise')

In [376]:
df_50 = df_50[~(((df_50['Year'].isna()) | (df_50['Year'] == 0.0)) &
                 ((df_50['Temp_year'].isna()) | (df_50['Temp_year'] == 0.0)))]   # removing all rows that do not have any year information
df_50

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Time,Species,Temp_year,Match_check
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Not stated,Nurse shark,NaN,False
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,Serious abdonminal injuries,N,1823 hrs,Tiger or Bull shark,NaN,False
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,1330hrs,Bronze whaler?,NaN,False
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,Leg and foot injury,N,0100hrs,unknown 1.2m shark,NaN,False
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,Head face and arms,N,Not stated,Tiger shark 4m,NaN,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6969,"No date, Before Mar-1995",0.0,Unprovoked,FRENCH POLYNESIA,Tuamotus,Rangiroa,Fishing,male,M,NaN,"Speared a shark, fell overboard and another sh...",N,NaN,NaN,1995.0,False
6970,Before 1996,0.0,Unprovoked,SUDAN,Red Sea State,Sha'ab Rumi,Diving,Erik Bjurstrom,M,NaN,"No injury, BC ripped",N,NaN,Silvertip shark,1996.0,False
6971,"No date, Before Aug-1989",0.0,Unprovoked,VANUATU,Malampa Province,Malakula,NaN,female,F,NaN,FATAL,Y,NaN,NaN,1989.0,False
6972,"No date, Before Aug-1987",0.0,Provoked,VANUATU,Malampa Province,"Hokai, Malakula",Attempting to drive shark from area,a chief,M,NaN,Speared shark broke outrigger of canoe throwin...,N,NaN,A large hammerhead shark,1987.0,False
6973,"No date, Before 1987",0.0,Unprovoked,IRAN,Khuzestan Province,"Ahvaz, on the Karun River",NaN,Mr. Jabar-Kaaby,M,NaN,Foot severed,N,NaN,Bull shark,1987.0,False

In [ ]:
# SABINA COMMENT: I think there's a simpler way to do this but it used a lambda on the whole dataframe
# df_50["Year"] = df.apply(lambda row: row['Year'] if (not np.isnan(row['Year']) or row['Year'] != 0) else row['Temp_year'], axis=1)
# If you get a KeyError, replace axis=1 with axis=0, I always get them confused
df_50['Year'] = np.where(                                   # replacing missing value in Year with extracted value in Temp_year
    ((df_50['Year'].isna()) | (df_50['Year'] == 0.0)) &
    (df_50['Temp_year'].between(1000, 9999)),
    df_50['Temp_year'],
    df_50['Year']
)


df_50[["Year", "Temp_year"]]

        Year  Temp_year
0     2025.0        NaN
1     2025.0        NaN
2     2025.0        NaN
3     2025.0        NaN
4     2025.0        NaN
...      ...        ...
6969  1995.0     1995.0
6970  1996.0     1996.0
6971  1989.0     1989.0
6972  1987.0     1987.0
6973  1987.0     1987.0

[3960 rows x 2 columns]

In [378]:
df_50.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3960 entries, 0 to 6973
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         3960 non-null   object
 1   Year         3960 non-null   float64
 2   Type         3945 non-null   object
 3   Country      3954 non-null   object
 4   State        3790 non-null   object
 5   Location     3780 non-null   object
 6   Activity     3740 non-null   object
 7   Name         3888 non-null   object
 8   Sex          3731 non-null   object
 9   Age          2873 non-null   object
 10  Injury       3947 non-null   object
 11  Fatal Y/N    3690 non-null   object
 12  Time         2624 non-null   object
 13  Species      2567 non-null   object
 14  Temp_year    3925 non-null   float64
 15  Match_check  3960 non-null   bool
dtypes: bool(1), float64(2), object(13)
memory usage: 498.9+ KB

In [ ]:
invalid_count = (~df_50['Year'].between(1000, 9999)).sum() # checking how many values are not 4 digits 
print("Number of invalid years:", invalid_count)
# SABINA COMMENT: Nice :)

Number of invalid years: 2

In [380]:
df_50.loc[~df_50['Year'].between(1000, 9999), ['Date', 'Year', 'Temp_year']]

               Date  Year  Temp_year
6919   Ca. 77  A.D.  77.0        NaN
6920     Ca. 5 A.D.   5.0        NaN

In [381]:
df_50['Match_check'] = df_50['Year'] == df_50['Temp_year']
df_50['Match_check']

0       False
1       False
2       False
3       False
4       False
        ...
6969     True
6970     True
6971     True
6972     True
6973     True
Name: Match_check, Length: 3960, dtype: bool

In [382]:
print(df_50['Match_check'].value_counts())

Match_check
True     3906
False      54
Name: count, dtype: int64

In [383]:
df_50_false = df_50[df_50['Match_check'] == False]
df_50_false.info()

<class 'pandas.core.frame.DataFrame'>
Index: 54 entries, 0 to 6920
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         54 non-null     object
 1   Year         54 non-null     float64
 2   Type         54 non-null     object
 3   Country      53 non-null     object
 4   State        49 non-null     object
 5   Location     50 non-null     object
 6   Activity     50 non-null     object
 7   Name         54 non-null     object
 8   Sex          53 non-null     object
 9   Age          40 non-null     object
 10  Injury       54 non-null     object
 11  Fatal Y/N    49 non-null     object
 12  Time         41 non-null     object
 13  Species      43 non-null     object
 14  Temp_year    19 non-null     float64
 15  Match_check  54 non-null     bool
dtypes: bool(1), float64(2), object(13)
memory usage: 6.8+ KB

In [384]:
df_50[df_50['Temp_year'].isna()][['Date', 'Year', 'Temp_year']]

                      Date    Year  Temp_year
0             14th October  2025.0        NaN
1             11th October  2025.0        NaN
2              7th October  2025.0        NaN
3           29th September  2025.0        NaN
4           27th September  2025.0        NaN
5            6th September  2025.0        NaN
6            1st September  2025.0        NaN
7              30th August  2025.0        NaN
8              18th August  2025.0        NaN
9              17th August  2025.0        NaN
10             16th August  2025.0        NaN
11              7th August  2025.0        NaN
12              1st August  2025.0        NaN
13               28th July  2025.0        NaN
14               25th July  2025.0        NaN
15               22nd July  2025.0        NaN
16               20th July  2025.0        NaN
17               19th July  2025.0        NaN
18               18th July  2025.0        NaN
19               15th July  2025.0        NaN
20               6th July   2025.0        NaN
21                6th July  2025.0        NaN
22                4th July  2025.0        NaN
23               29th June  2025.0        NaN
24               25th June  2025.0        NaN
25               22nd June  2025.0        NaN
26               17th June  2025.0        NaN
28                31st May  2025.0        NaN
41               27-Feb-25  2025.0        NaN
485             10-Jul-202  2020.0        NaN
5379            22-Jul-144  1944.0        NaN
5537         Woirld War II  1939.0        NaN
5573  Reported 26-Sep-t937  1937.0        NaN
6919          Ca. 77  A.D.    77.0        NaN
6920            Ca. 5 A.D.     5.0        NaN

In [385]:
df_50_diff = df_50[((df_50['Temp_year'].notna()) & (df_50['Temp_year'] != df_50['Year'])) | (~df_50['Year'].between(1975, 2025))]

df_50_diff[['Date', 'Year', 'Temp_year']].head(20)                      # these are the years that don't match with Year - since its only 19 out of almost 4000 rows, we can remove this data

                      Date    Year  Temp_year
80     2024-07-04 00:00:00  2026.0     2024.0
81     2024-07-04 00:00:00  2025.0     2024.0
517            01-Feb-2010  2020.0     2010.0
551            25-Oct-2019  2018.0     2019.0
609            09-May-2018  2019.0     2018.0
629            18-Feb-2018  2019.0     2018.0
716               Jun-1018  2018.0     1018.0
1394           14-May-2014  2013.0     2014.0
1521              Apr-2013  2012.0     2013.0
1624           26-Jun-2008  2011.0     2008.0
1659  Reported 10-Mar-2010  2011.0     2010.0
1905           06-Dec-2006  2008.0     2006.0
2033         November 2011  2007.0     2011.0
3397           27-Jul-1989  1969.0     1989.0
3685           23-Oct-1962  1982.0     1962.0
4329        Summer of 1996  1966.0     1996.0
4810                 21764  1959.0     2176.0
5060                 19955  1954.0     1995.0
5379            22-Jul-144  1944.0        NaN
5537         Woirld War II  1939.0        NaN

In [386]:
df_50_last_years = df_50.drop(
    columns=["Temp_year", "Match_check", "Time"]).drop(index=df_50_diff.index.tolist() + [6919, 6920])
df_50_last_years

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,Serious abdonminal injuries,N,Tiger or Bull shark
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,Bronze whaler?
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,Leg and foot injury,N,unknown 1.2m shark
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,Head face and arms,N,Tiger shark 4m
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6969,"No date, Before Mar-1995",1995.0,Unprovoked,FRENCH POLYNESIA,Tuamotus,Rangiroa,Fishing,male,M,NaN,"Speared a shark, fell overboard and another sh...",N,NaN
6970,Before 1996,1996.0,Unprovoked,SUDAN,Red Sea State,Sha'ab Rumi,Diving,Erik Bjurstrom,M,NaN,"No injury, BC ripped",N,Silvertip shark
6971,"No date, Before Aug-1989",1989.0,Unprovoked,VANUATU,Malampa Province,Malakula,NaN,female,F,NaN,FATAL,Y,NaN
6972,"No date, Before Aug-1987",1987.0,Provoked,VANUATU,Malampa Province,"Hokai, Malakula",Attempting to drive shark from area,a chief,M,NaN,Speared shark broke outrigger of canoe throwin...,N,A large hammerhead shark
6973,"No date, Before 1987",1987.0,Unprovoked,IRAN,Khuzestan Province,"Ahvaz, on the Karun River",NaN,Mr. Jabar-Kaaby,M,NaN,Foot severed,N,Bull shark

In [387]:
df_50_last_years = df_50_last_years.sort_values(by='Year', ascending=False)
df_50_last_years

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
28,31st May,2025.0,Unprovoked,USA,California,Montara State Beach,Surfing,Jens Heller,M,42,No injury,N,Great White
30,2025-05-26 00:00:00,2025.0,Unprovoked,Vanuatu,South Santo,Espiitu Santo Island,Swimming,Tumas,M,14,Multiple injuries to body one hand and leg bit...,Y,Not stated
31,2025-05-15 00:00:00,2025.0,Unprovoked,Australia,South Australia,Port Noarlunga,Swimming,Richard Vinall,M,66,Injury to thigh,N,Not stated
32,2025-05-08 00:00:00,2025.0,Unprovoked,Jamaica,Montego Bay,Rose Hall beach,Paddling,Rachel Smith,F,26,minor injuries to fingers of left hand,N,Small shark 1m (3ft) long
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3913,02-May-1976,1976.0,Watercraft,SOUTH AFRICA,Western Cape Province,40 km off Cape Point,Competing in a light tackle game fishing,"6 m skiboat, occupants: Terry McManus, Dan Cla...",NaN,NaN,"Shark following hooked fish, rammed & holed boat",N,"Mako shark, 180-kg [397-lb]"
3914,28-Apr-1976,1976.0,Invalid,USA,Texas,Galveston Island,NaN,Unknown,NaN,NaN,"Possible drowning victim, remains retrieved fr...",NaN,Shark involvement prior to death was not confi...
3915,12-Mar-1976,1976.0,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Standing,Glen Wright,M,21 or 26,Lacerations to left leg,N,NaN
3916,12-Mar-1976,1976.0,Watercraft,SOUTH AFRICA,Western Cape Province,Robberg Point,Fishing,"boat, occupants: Jacob Kruger & crew",NaN,NaN,"No injury to occupants, shark buckled prop shaft",N,Whale shark
3892,23-Nov-1976,1976.0,Invalid,SOUTH AFRICA,KwaZulu-Natal,Warner Beach,Swimming,Jimmy Jackson,M,17,Laceration to foot,NaN,Questionable incident

# From this point filtered data for last 50 years

SABINA COMMENT: But where is the intermediate data that has the last 50 years filtered?

In [388]:
df_50_last_years.nunique() # next we need to clean Country, Sex, Age, Fatal
                            # how to clean and sort age and activity??

Date         3342
Year           50
Type           12
Country       154
State         488
Location     2674
Activity      624
Name         3285
Sex             7
Age           205
Injury       2416
Fatal Y/N       8
Species      1187
dtype: int64

## Clean Country

In [389]:
df_50_last_years['Country'].unique()

array(['Columbia', 'USA', 'Vanuatu', 'Australia', 'Jamaica', 'Israel',
       'Mexico', 'Maldives', 'Philippines', 'Bahamas', 'Turks and Caicos',
       'Mozambique', 'New Caledonia', 'French Polynesia', 'Costa Rica',
       'Puerto Rico', 'Spain', 'Canary Islands', 'South Africa',
       'Maldive Islands', 'Tobago', 'AUSTRALIA', 'INDIA', 'TRINIDAD',
       'BAHAMAS', 'SOUTH AFRICA', 'Thailand', 'Honduras', 'Egypt',
       'New Zealand', 'Hawaii', 'Indonesia', 'Belize', 'Morocco', 'CUBA',
       'TURKS and CaICOS', 'NEW CALEDONIA', 'FRENCH POLYNESIA', 'EGYPT',
       'BRAZIL', 'MeXICO', 'FIJI', 'ARGENTINA', 'SEYCHELLES', 'MEXICO',
       'ECUADOR', 'BELIZE', 'NEW ZEALAND', 'SPAIN', 'COLOMBIA', 'SAMOA',
       'PORTUGAL', 'Coral Sea', 'PHILIPPINES', 'THAILAND', 'MALDIVES',
       'JAMAICA', 'COLUMBIA', 'COSTA RICA', 'INDONESIA', 'JAPAN',
       'ENGLAND', 'ST KITTS / NEVIS', 'JORDAN',
       'British Overseas Territory', 'CANADA', 'ST MARTIN',
       'REUNION ISLAND', 'CHINA', 'ISRAEL', 'PAPUA NEW GUINEA', 'IRELAND',
       'ITALY', 'REUNION', 'ST HELENA, British overseas territory',
       'UNITED ARAB EMIRATES', 'UNITED KINGDOM', 'COMOROS', 'MAURITIUS',
       'LIBYA', nan, 'MALAYSIA', 'SOLOMON ISLANDS', 'DOMINICAN REPUBLIC',
       'CAPE VERDE', 'KENYA', 'CAYMAN ISLANDS', 'Fiji', 'PUERTO RICO',
       'ATLANTIC OCEAN', 'MOZAMBIQUE', 'ARUBA', 'FRANCE', 'ST. MARTIN',
       'TRINIDAD & TOBAGO', 'GREECE', 'PALESTINIAN TERRITORIES', 'TAIWAN',
       'DIEGO GARCIA', 'GUAM', 'KIRIBATI', 'CHILE', 'SAUDI ARABIA',
       'NIGERIA', 'CROATIA', 'TONGA', 'SCOTLAND',
       'UNITED ARAB EMIRATES (UAE)', 'TURKS & CAICOS', 'SUDAN', 'ANTIGUA',
       'RUSSIA', 'MADAGASCAR', 'VIETNAM', 'AZORES', 'MALTA',
       'SOUTH KOREA', 'PANAMA', 'SOMALIA', 'NEVIS', 'SENEGAL', 'YEMEN',
       'NORWAY', 'BRITISH VIRGIN ISLANDS', 'Sierra Leone', 'GULF OF ADEN',
       'MEXICO ', 'VANUATU', 'VENEZUELA', 'HONDURAS', 'GRAND CAYMAN',
       'ST. MAARTIN', 'LIBERIA', 'Seychelles', ' TONGA', 'URUGUAY',
       'SRI LANKA', 'MICRONESIA', 'CARIBBEAN SEA', 'TANZANIA', 'OKINAWA',
       'MARSHALL ISLANDS', 'KOREA', 'EGYPT / ISRAEL', 'HONG KONG',
       'NORTHERN ARABIAN SEA', 'ANGOLA', 'EL SALVADOR', 'MONTENEGRO',
       'IRAN', 'TUNISIA', 'BERMUDA', 'NAMIBIA', 'NORTH ATLANTIC OCEAN',
       'SOUTH CHINA SEA'], dtype=object)

In [390]:
df_50_last_years['Country'] = df_50_last_years['Country'].str.strip().str.title()

In [391]:
df_50_last_years['Country'].dropna().sort_values().unique()

array(['Angola', 'Antigua', 'Argentina', 'Aruba', 'Atlantic Ocean',
       'Australia', 'Azores', 'Bahamas', 'Belize', 'Bermuda', 'Brazil',
       'British Overseas Territory', 'British Virgin Islands', 'Canada',
       'Canary Islands', 'Cape Verde', 'Caribbean Sea', 'Cayman Islands',
       'Chile', 'China', 'Colombia', 'Columbia', 'Comoros', 'Coral Sea',
       'Costa Rica', 'Croatia', 'Cuba', 'Diego Garcia',
       'Dominican Republic', 'Ecuador', 'Egypt', 'Egypt / Israel',
       'El Salvador', 'England', 'Fiji', 'France', 'French Polynesia',
       'Grand Cayman', 'Greece', 'Guam', 'Gulf Of Aden', 'Hawaii',
       'Honduras', 'Hong Kong', 'India', 'Indonesia', 'Iran', 'Ireland',
       'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan', 'Kenya',
       'Kiribati', 'Korea', 'Liberia', 'Libya', 'Madagascar', 'Malaysia',
       'Maldive Islands', 'Maldives', 'Malta', 'Marshall Islands',
       'Mauritius', 'Mexico', 'Micronesia', 'Montenegro', 'Morocco',
       'Mozambique', 'Namibia', 'Nevis', 'New Caledonia', 'New Zealand',
       'Nigeria', 'North Atlantic Ocean', 'Northern Arabian Sea',
       'Norway', 'Okinawa', 'Palestinian Territories', 'Panama',
       'Papua New Guinea', 'Philippines', 'Portugal', 'Puerto Rico',
       'Reunion', 'Reunion Island', 'Russia', 'Samoa', 'Saudi Arabia',
       'Scotland', 'Senegal', 'Seychelles', 'Sierra Leone',
       'Solomon Islands', 'Somalia', 'South Africa', 'South China Sea',
       'South Korea', 'Spain', 'Sri Lanka',
       'St Helena, British Overseas Territory', 'St Kitts / Nevis',
       'St Martin', 'St. Maartin', 'St. Martin', 'Sudan', 'Taiwan',
       'Tanzania', 'Thailand', 'Tobago', 'Tonga', 'Trinidad',
       'Trinidad & Tobago', 'Tunisia', 'Turks & Caicos',
       'Turks And Caicos', 'United Arab Emirates',
       'United Arab Emirates (Uae)', 'United Kingdom', 'Uruguay', 'Usa',
       'Vanuatu', 'Venezuela', 'Vietnam', 'Yemen'], dtype=object)

In [392]:
df_50_last_years.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
28,31st May,2025.0,Unprovoked,Usa,California,Montara State Beach,Surfing,Jens Heller,M,42,No injury,N,Great White
30,2025-05-26 00:00:00,2025.0,Unprovoked,Vanuatu,South Santo,Espiitu Santo Island,Swimming,Tumas,M,14,Multiple injuries to body one hand and leg bit...,Y,Not stated
31,2025-05-15 00:00:00,2025.0,Unprovoked,Australia,South Australia,Port Noarlunga,Swimming,Richard Vinall,M,66,Injury to thigh,N,Not stated
32,2025-05-08 00:00:00,2025.0,Unprovoked,Jamaica,Montego Bay,Rose Hall beach,Paddling,Rachel Smith,F,26,minor injuries to fingers of left hand,N,Small shark 1m (3ft) long

In [ ]:
df_50_last_years = df_50_last_years.dropna(subset=['Country']) # Removed rows with NaN in "Country"
df_50_last_years
# SABINA COMMENT: Why are the rows without a country irrelevant?

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
28,31st May,2025.0,Unprovoked,Usa,California,Montara State Beach,Surfing,Jens Heller,M,42,No injury,N,Great White
30,2025-05-26 00:00:00,2025.0,Unprovoked,Vanuatu,South Santo,Espiitu Santo Island,Swimming,Tumas,M,14,Multiple injuries to body one hand and leg bit...,Y,Not stated
31,2025-05-15 00:00:00,2025.0,Unprovoked,Australia,South Australia,Port Noarlunga,Swimming,Richard Vinall,M,66,Injury to thigh,N,Not stated
32,2025-05-08 00:00:00,2025.0,Unprovoked,Jamaica,Montego Bay,Rose Hall beach,Paddling,Rachel Smith,F,26,minor injuries to fingers of left hand,N,Small shark 1m (3ft) long
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3913,02-May-1976,1976.0,Watercraft,South Africa,Western Cape Province,40 km off Cape Point,Competing in a light tackle game fishing,"6 m skiboat, occupants: Terry McManus, Dan Cla...",NaN,NaN,"Shark following hooked fish, rammed & holed boat",N,"Mako shark, 180-kg [397-lb]"
3914,28-Apr-1976,1976.0,Invalid,Usa,Texas,Galveston Island,NaN,Unknown,NaN,NaN,"Possible drowning victim, remains retrieved fr...",NaN,Shark involvement prior to death was not confi...
3915,12-Mar-1976,1976.0,Unprovoked,Usa,Florida,"New Smyrna Beach, Volusia County",Standing,Glen Wright,M,21 or 26,Lacerations to left leg,N,NaN
3916,12-Mar-1976,1976.0,Watercraft,South Africa,Western Cape Province,Robberg Point,Fishing,"boat, occupants: Jacob Kruger & crew",NaN,NaN,"No injury to occupants, shark buckled prop shaft",N,Whale shark
3892,23-Nov-1976,1976.0,Invalid,South Africa,KwaZulu-Natal,Warner Beach,Swimming,Jimmy Jackson,M,17,Laceration to foot,NaN,Questionable incident

## Clean Sex

In [394]:
df_50_last_years['Sex'].unique()

array(['M', 'F', 'F ', 'M ', nan, ' M', 'm', 'lli'], dtype=object)

In [395]:
df_50_last_years['Sex'] = df_50_last_years['Sex'].str.strip().str.upper()
df_50_last_years['Sex'].unique()

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/4248088207.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Sex'] = df_50_last_years['Sex'].str.strip().str.upper()

array(['M', 'F', nan, 'LLI'], dtype=object)

In [396]:
df_50_last_years[df_50_last_years['Sex'] == "LLI"] # there is only one row with LLI in a column Sex, so I will change it to NaN

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
2344,11-Nov-2004,2004.0,Unprovoked,Usa,California,"Bunkers, Humboldt Bay, Eureka, Humboldt County",Surfing,Brian Kang,LLI,38,"Lacerations to hand, knee & thigh",N,5.5 m [18'] white shark

In [397]:
df_50_last_years['Sex'] = df_50_last_years['Sex'].replace('LLI', np.nan)

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/1845379289.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Sex'] = df_50_last_years['Sex'].replace('LLI', np.nan)

In [398]:
df_50_last_years[df_50_last_years['Sex'].isna()]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
162,Reported 14 Jul-2023,2023.0,Watercraft,South Africa,Eastern Cape Province,Chinta East,Watching the sardine run,crew,NaN,NaN,"No injury to occupants, shark defated boat",N,NaN
146,23 Aug-2023,2023.0,Unprovoked,Usa,North Carolina,"Oak Island, Brunswick County",Wading,child,NaN,9,Minor injury to shoulder,N,NaN
281,07-May-2022,2022.0,Unprovoked,French Polynesia,Bora Bora,To'opua,NaN,NaN,NaN,NaN,Hand bitten,N,NaN
277,27-May-2022,2022.0,Unprovoked,Australia,Western Australia,Yallingup,Surfing,NaN,NaN,NaN,Knocked off board by a shark. No injury,N,"Bronze whaler shark, 2m"
253,19-Jul-2022,2022.0,Questionable,Usa,Florida,"Cape Canaveral, Brevard County",NaN,NaN,NaN,NaN,minor injuries,N,Shark involvement not confirmed
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3897,22-Sep-1976,1976.0,Sea Disaster,New Caledonia,NaN,Sarcelle,Shipwreck,a small boat,NaN,NaN,It was believed that survivors were killed by ...,N,NaN
3917,09-Mar-1976,1976.0,Watercraft,South Africa,Western Cape Province,"2 km from Macassar, False Bay",NaN,5 m skiboat; Stephanie,NaN,NaN,Shark breached hull of boat,N,White shark named “Spotty”
3913,02-May-1976,1976.0,Watercraft,South Africa,Western Cape Province,40 km off Cape Point,Competing in a light tackle game fishing,"6 m skiboat, occupants: Terry McManus, Dan Cla...",NaN,NaN,"Shark following hooked fish, rammed & holed boat",N,"Mako shark, 180-kg [397-lb]"
3914,28-Apr-1976,1976.0,Invalid,Usa,Texas,Galveston Island,NaN,Unknown,NaN,NaN,"Possible drowning victim, remains retrieved fr...",NaN,Shark involvement prior to death was not confi...
3916,12-Mar-1976,1976.0,Watercraft,South Africa,Western Cape Province,Robberg Point,Fishing,"boat, occupants: Jacob Kruger & crew",NaN,NaN,"No injury to occupants, shark buckled prop shaft",N,Whale shark

## Clean Fatal

In [399]:
df_50_last_years['Fatal Y/N'].unique()

array(['N', 'Y', 'F', nan, 'M', 'n', 'Nq', 'UNKNOWN', 2017], dtype=object)

In [400]:
df_50_last_years['Fatal Y/N'] = df_50_last_years['Fatal Y/N'].str.strip().str.upper()
df_50_last_years['Fatal Y/N'].unique()

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/1294677114.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Fatal Y/N'] = df_50_last_years['Fatal Y/N'].str.strip().str.upper()

array(['N', 'Y', 'F', nan, 'M', 'NQ', 'UNKNOWN'], dtype=object)

In [401]:
df_50_last_years['Fatal Y/N'].value_counts(dropna=False)

Fatal Y/N
N          3202
Y           430
NaN         265
UNKNOWN      24
F             5
M             3
NQ            1
Name: count, dtype: int64

In [402]:
df_50_last_years['Fatal Y/N'] = df_50_last_years['Fatal Y/N'].replace({'UNKNOWN': np.nan,'NQ': np.nan,'M': np.nan,'F': 'Y'})

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/702274590.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Fatal Y/N'] = df_50_last_years['Fatal Y/N'].replace({'UNKNOWN': np.nan,'NQ': np.nan,'M': np.nan,'F': 'Y'})

In [403]:
df_50_last_years['Fatal Y/N'].value_counts(dropna=False)

Fatal Y/N
N      3202
Y       435
NaN     293
Name: count, dtype: int64

## Clean Age

In [404]:
df_50_last_years['Age'].unique() # we need to keep the age range for potential clients 18 - 60

array(['14', '42', '66', '26', '45', '20', '30', '?', '30+', '37', '56',
       '29', 35, 58, 29, 24, 20, 55, 17, 12, 37, 36, 23, 40, 28, '40+',
       '9', '7', '12', '54', '48', '57', '8', '63', '39', '19', '50+',
       '85', '40', '16', '21', '18', '69', 16, 15, 45, 46, 19, 27, 25, 65,
       64, '46', 26, '13', nan, '11', '32', '10', '64', '62', 49, 21, 57,
       38, 69, 48, '60+', 61, 'Middle age', 68, 43, 14, 41, 30, 33, '15',
       '35', '24', '22', '50s', '47', '25', '73', '!2', '53', '34', '49',
       '41', '60', '59', '6', '30s', '17', '67', '58', '50', '55', '44',
       '52', '77', '20s', '65', '20/30', '38', 32, 8, 22, 56, 'Teen', 62,
       'teen', 18, '40s', 42, 13, 'M', 50, 51, 39, '31', '51', '43', '68',
       60, 10, 53, 54, 59, 71, 7, 52, 73, '45 and 15', 75, 9, '!!', 31,
       '!6', 34, 11, 47, 63, 4, 70, 67, "20's", '9 & 60', 74, '28 & 22',
       44, '22, 57, 31', '60s', 6, 'a minor', 82, 3, '40?', 66, 72, '36',
       '23', '71', '70', '18 months', '61', '28', '33', '28 & 26', '74',
       '27', '3', '86', '5', '18 or 20', '46 & 34', '28, 23 & 30',
       '12 or 13', 'Teens', 77, 84, '36 & 26', '8 or 10', '30 or 36', ' ',
       '\xa0 ', 'mid-30s', '33 or 37', '6½', '21 & ?', 5, '23 & 20',
       ' 30', '20?', '7      &    31', ' 28', '32 & 30', "60's",
       '16 to 18', '87', 'Elderly', 'mid-20s', 'Ca. 33', '74 ', '45 ',
       '21 or 26'], dtype=object)

In [405]:
df_50_last_years['Age'].value_counts()

Age
15           63
17           53
20           53
17           52
21           51
             ..
72            1
18 months     1
28 & 26       1
74            1
21 or 26      1
Name: count, Length: 205, dtype: int64

In [406]:
df_50_last_years['Age'].astype(str).str.strip()

0             14
28            42
30            14
31            66
32            26
          ...
3913         nan
3914         nan
3915    21 or 26
3916         nan
3892          17
Name: Age, Length: 3930, dtype: object

In [407]:
df_50_last_years['Age'].unique()

array(['14', '42', '66', '26', '45', '20', '30', '?', '30+', '37', '56',
       '29', 35, 58, 29, 24, 20, 55, 17, 12, 37, 36, 23, 40, 28, '40+',
       '9', '7', '12', '54', '48', '57', '8', '63', '39', '19', '50+',
       '85', '40', '16', '21', '18', '69', 16, 15, 45, 46, 19, 27, 25, 65,
       64, '46', 26, '13', nan, '11', '32', '10', '64', '62', 49, 21, 57,
       38, 69, 48, '60+', 61, 'Middle age', 68, 43, 14, 41, 30, 33, '15',
       '35', '24', '22', '50s', '47', '25', '73', '!2', '53', '34', '49',
       '41', '60', '59', '6', '30s', '17', '67', '58', '50', '55', '44',
       '52', '77', '20s', '65', '20/30', '38', 32, 8, 22, 56, 'Teen', 62,
       'teen', 18, '40s', 42, 13, 'M', 50, 51, 39, '31', '51', '43', '68',
       60, 10, 53, 54, 59, 71, 7, 52, 73, '45 and 15', 75, 9, '!!', 31,
       '!6', 34, 11, 47, 63, 4, 70, 67, "20's", '9 & 60', 74, '28 & 22',
       44, '22, 57, 31', '60s', 6, 'a minor', 82, 3, '40?', 66, 72, '36',
       '23', '71', '70', '18 months', '61', '28', '33', '28 & 26', '74',
       '27', '3', '86', '5', '18 or 20', '46 & 34', '28, 23 & 30',
       '12 or 13', 'Teens', 77, 84, '36 & 26', '8 or 10', '30 or 36', ' ',
       '\xa0 ', 'mid-30s', '33 or 37', '6½', '21 & ?', 5, '23 & 20',
       ' 30', '20?', '7      &    31', ' 28', '32 & 30', "60's",
       '16 to 18', '87', 'Elderly', 'mid-20s', 'Ca. 33', '74 ', '45 ',
       '21 or 26'], dtype=object)

In [408]:
df_50_last_years['Age']

0             14
28            42
30            14
31            66
32            26
          ...
3913         NaN
3914         NaN
3915    21 or 26
3916         NaN
3892          17
Name: Age, Length: 3930, dtype: object

In [409]:
df_50_last_years.nunique() # How to approach cleaning/using data in Injury, Age, Activity, Date(for season)

Date         3339
Year           50
Type           12
Country       126
State         487
Location     2673
Activity      623
Name         3280
Sex             2
Age           205
Injury       2414
Fatal Y/N       2
Species      1187
dtype: int64

In [410]:
df_50_last_years.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
28,31st May,2025.0,Unprovoked,Usa,California,Montara State Beach,Surfing,Jens Heller,M,42,No injury,N,Great White
30,2025-05-26 00:00:00,2025.0,Unprovoked,Vanuatu,South Santo,Espiitu Santo Island,Swimming,Tumas,M,14,Multiple injuries to body one hand and leg bit...,Y,Not stated
31,2025-05-15 00:00:00,2025.0,Unprovoked,Australia,South Australia,Port Noarlunga,Swimming,Richard Vinall,M,66,Injury to thigh,N,Not stated
32,2025-05-08 00:00:00,2025.0,Unprovoked,Jamaica,Montego Bay,Rose Hall beach,Paddling,Rachel Smith,F,26,minor injuries to fingers of left hand,N,Small shark 1m (3ft) long

In [411]:
df_50_last_years['Date_raw'] = df_50_last_years['Date'] # keeping original Date column for potential season extraction

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/2126515903.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Date_raw'] = df_50_last_years['Date'] # keeping original Date column for potential season extraction

In [412]:
df.columns = df.columns.str.strip()
if "Date" not in df.columns:
    raise KeyError(f"'Date' column not found. Columns: {list(df.columns)}") # ensure 'Date' column exists

df["Date_raw"] = df["Date"].astype(str) # keep the raw for QA

In [413]:
s = df["Date"].astype(str).str.strip()
s = s.str.replace(r"(?<=\d)(st|nd|rd|th)", "", regex=True)
s = s.str.replace(r"\b\d{3,4}\s*hrs\b", "", regex=True, )
s = s.replace([r"^\s*(not\s*stated|unknown|undetermined|\?|nan)\s*$", ""],
              np.nan, regex=True) # normalize placeholders to NaN

In [414]:
parsed = pd.to_datetime(s, errors="coerce", dayfirst=True) # initial parse attempt

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/1353127596.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  parsed = pd.to_datetime(s, errors="coerce", dayfirst=True) # initial parse attempt

In [ ]:
mname = s.str.extract(r"(?i)\b(jan|feb|mar|apr|may|jun|jul|aug|sep|sept|oct|nov|dec)\b", expand=False)
month_map = {"jan":1,"feb":2,"mar":3,"apr":4,"may":5,"jun":6,
             "jul":7,"aug":8,"sep":9,"sept":9,"oct":10,"nov":11,"dec":12}
# SABINA COMMENT: Why change the month name to numbers instead of month names?
mnum = mname.str.lower().map(month_map)

year_series = pd.to_numeric(df.get("Year", np.nan), errors="coerce")
mask = parsed.isna() & mnum.notna() & year_series.notna()
parsed.loc[mask] = pd.to_datetime(
    dict(year=year_series[mask].astype(int), month=mnum[mask].astype(int), day=1),
    errors="coerce"
) # construct dates where month name and year exist

In [416]:
df["Date_parsed"] = parsed  
print("Date_parsed dtype:", df["Date_parsed"].dtype) # ensure datetime64[ns]

Date_parsed dtype: datetime64[ns]

In [ ]:
def month_to_season(m):
    if pd.isna(m): return None
    if m in [12,1,2]:  return "Winter"
    if m in [3,4,5]:   return "Spring"
    if m in [6,7,8]:   return "Summer"
    return "Autumn"

df["Season"] = df["Date_parsed"].dt.month.map(month_to_season)

df.loc[df["Season"].isna() & mnum.notna(), "Season"] = mnum.map(month_to_season)

df["Season"] = pd.Categorical(df["Season"],
                              categories=["Winter","Spring","Summer","Autumn"],
                              ordered=True) # ordered category (nice for sorting/plots)
                            # SABINA COMMENT: Nice! You should've mentioned that during class, I forgot about it!

In [418]:
print("\nSeason counts (incl. missing):")
print(df["Season"].value_counts(dropna=False))
display(df[["Date_raw","Date_parsed","Season"]].head(12)) # show sample results

Season counts (incl. missing):
Season
Summer    2006
Winter    1783
Autumn    1569
Spring    1421
NaN        271
Name: count, dtype: int64

          Date_raw Date_parsed Season
0     14th October         NaT    NaN
1     11th October         NaT    NaN
2      7th October         NaT    NaN
3   29th September         NaT    NaN
4   27th September         NaT    NaN
5    6th September         NaT    NaN
6    1st September         NaT    NaN
7      30th August         NaT    NaN
8      18th August         NaT    NaN
9      17th August         NaT    NaN
10     16th August         NaT    NaN
11      7th August         NaT    NaN

In [423]:
df_50_last_years["Date"].unique

<bound method Series.unique of 0              14th October
28                 31st May
30      2025-05-26 00:00:00
31      2025-05-15 00:00:00
32      2025-05-08 00:00:00
               ...
3913            02-May-1976
3914            28-Apr-1976
3915            12-Mar-1976
3916            12-Mar-1976
3892            23-Nov-1976
Name: Date, Length: 3930, dtype: object>

In [427]:
df_50_last_years.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3930 entries, 0 to 3892
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3930 non-null   object
 1   Year       3930 non-null   float64
 2   Type       3916 non-null   object
 3   Country    3930 non-null   object
 4   State      3768 non-null   object
 5   Location   3758 non-null   object
 6   Activity   3716 non-null   object
 7   Name       3858 non-null   object
 8   Sex        3701 non-null   object
 9   Age        2861 non-null   object
 10  Injury     3917 non-null   object
 11  Fatal Y/N  3637 non-null   object
 12  Species    2552 non-null   object
 13  Date_raw   3930 non-null   object
dtypes: float64(1), object(13)
memory usage: 460.5+ KB

In [428]:
# Function to classify injury severity
def classify_injury(text):
    if pd.isna(text):
        return np.nan

    text = text.lower()

    # Severe injuries
    severe_keywords = [
        "fatal", "death", "amputation", "severed", "torn off",
        "massive", "critical", "major", "severe", "life-threatening",
        "lost", "missing limb", "unconscious"
    ]

    # Medium injuries
    medium_keywords = [
        "deep", "laceration", "multiple bites", "serious", "fracture",
        "severe bleeding", "puncture", "bitten", "torn", "damaged"
    ]

    # Low injuries
    low_keywords = [
        "minor", "small", "superficial", "scratch", "abrasion",
        "bruise", "nipped", "no injury", "slight"
    ]

    if any(word in text for word in severe_keywords):
        return "Severe"
    elif any(word in text for word in medium_keywords):
        return "Medium"
    elif any(word in text for word in low_keywords):
        return "Low"
    else:
        return "Unknown"

In [429]:
df_50_last_years['Injury_Severity'] = df_50_last_years['Injury'].apply(classify_injury) # classify injury severity

/var/folders/pl/qjnl2n816kd5trwzkx1r4f9r0000gp/T/ipykernel_8418/3718348109.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Injury_Severity'] = df_50_last_years['Injury'].apply(classify_injury) # classify injury severity

In [430]:
# Display injury severity counts and sample data
print(df_50_last_years['Injury_Severity'].value_counts(dropna=False))
display(df_50_last_years[['Date', 'Activity', 'Injury', 'Injury_Severity']].head(10))

Injury_Severity
Medium     1904
Unknown     771
Severe      632
Low         610
NaN          13
Name: count, dtype: int64

,Date,Activity,Injury,Injury_Severity
0,14th October,Swimming with sharks,Severe hand injury,Severe
28,31st May,Surfing,No injury,Low
30,2025-05-26 00:00:00,Swimming,Multiple injuries to body one hand and leg bit...,Medium
31,2025-05-15 00:00:00,Swimming,Injury to thigh,Unknown
32,2025-05-08 00:00:00,Paddling,minor injuries to fingers of left hand,Low
33,2025-04-21 00:00:00,Diving,Remains recovered several days after the attcks,Unknown
34,2025-04-20 00:00:00,Rescuing female companion,Victim drown and was scavenged by sharks,Unknown
35,2025-04-19 00:00:00,snorkeling,Injuries to right shoulder,Unknown
36,2025-04-12 00:00:00,Undisclosed,Injuries to right hand and arm,Unknown
37,2025-03-26 00:00:00,Swimming,Bumping to the body,Unknown